{"pageProps":{"content":"\nKære Computer,\n\\\n\\\nOoof it has been a minute since I started ye olde newsletter more than two years ago, never to be heard from again.\nWhat did I do in the meantime? Well not much, except __**TWO ENTIRE HUMANS**__. Talk about a task I'm glad I underestimated beforehand.\nIn my extremely limited downtime, I enjoyed digging myself deeper into the rabbit hole of how to optimize the technical aspect of this blog.\nI spent entirely too much time over-engineering a custom [static page generator](https://en.wikipedia.org/wiki/Static_site_generator) for these Markdown posts,\nbuilding a custom continuous delivery pipeline with [Github Actions](https://docs.github.com/en/actions/about-github-actions/understanding-github-actions) that publishes the changes from every git commit to a cloud server instantaneously.\n\\\n\\\n![Question mark](/posts/huh.png)\n\\\n\\\n*Then* I finally got cracking on implementing the immaculately cute design for the blog that\n[AK](https://www.instagram.com/annekatrineraahede/) made me, also two whole years ago.\nPlease please if you're reading this in the newsletter format, go to the [web](https://nynnechristoffersen.com/) and look at it there on **desktop**, to get the full experience.\n\\\n\\\n![perfect when I'm dead](/posts/perfect.png)\n\\\n\\\nOne of the reasons I have postponed writing for this long, has perhaps also been some kind of trepidation, not wanting to come out with anything less than **perfect**.\nA feeling that only grew as time moved on. With this meandering nothing-burger post, I hope to get over that, or at least shushhh the voice enough to get to writing.\nNot necessarily with any kind of promise of frequency. But with the kind of open, curious and excited space in my mind I can only find if I manage to suspend judgment and\ntoss out all \"plans for greatness\". There are a lot of things I want to write about: imposter syndrome, raging against the computer machine, teaching, learning,\ntechnologies I love and hate, people and projects that inspire me.\n\\\n\\\n![I contain the knowledge of 1000 blogs](/posts/blog-knowledge.jpg)\n\\\n\\\n The internet really is going to shit. I feel like carving out a little corner of it and making it nice and cozy and delightful.\n\\\n\\\nThanks for reading.\n\\\n\\\n♡ Nynne\n\\\n\\\n![computers connecting - the internet!](/posts/from-me-2-u.gif)\n\n","frontmatter":{"title":"Hello World","date":"Saturday, Aug 10, 2024"}},"__N_SSG":true}